[
	{
		"Name": "",
		"AbilityModifier": [ 0, 0, 0, 0, 0, 0 ],
		"Traits": {
			"Age": "",
			"Alignment": "",
			"Size": "",
			"Speed": 0,
			"Languages": ""
		},
		"Passive": [
			{
				"Name": "",
				"Description": ""
			}
		],
		"Ability": [],
		"ToolOptions": [],
		"WeaponProficiency": [],
		"Subraces": [
			{
				"Name": "",
				"AbilityModifier": [ 0, 0, 0, 0, 0, 0 ],
				"Racial": []
			}
		]
	},
	{
		"Name": "Dwarf",
		"AbilityModifier": [ 0, 0, 2, 0, 0, 0 ],
		"Traits": {
			"Age": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.",
			"Alignment": "Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.",
			"Size": "Medium",
			"Speed": 25,
			"Languages": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
		},
		"Passive": [
			{
				"Name": "Darkvision",
				"Description": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
			},
			{
				"Name": "Dwarven Resilience",
				"Description": "You have advantage on saving throws against poison, and you have resistance against poison damage."
			},
			{
				"Name": "Stonecunning",
				"Description": " Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
			},
			{
				"Name": "Heavy Armor",
				"Description": "Wearing heavy armor doesn't reduce your speed."
			}
		],
		"Ability": [],
		"ToolOptions": [ "Smith's tools", "Brewer's supplies", "Mason's tools" ],
		"WeaponProficiency": [ "Battleaxe", "Handaxe", "Throwing hammer", "Warhammer" ],
		"Subraces": [
			{
				"Name": "Hill Dwarf",
				"AbilityModifier": [ 0, 0, 0, 0, 1, 0 ],
				"Racial": [ "Dwarven Toughness" ]
			},
			{
				"Name": "Mountain Dwarf",
				"AbilityModifier": [ 2, 0, 0, 0, 0, 0 ],
				"Racial": [ "Dwarven Armor Training" ]
			}
		]
	},
	{
		"Name": "Elf",
		"AbilityModifier": [ 0, 2, 0, 0, 0, 0 ],
		"Traits": {
			"Age": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.",
			"Alignment": "Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not. The drow are an exception; their exile into the Underdark has made them vicious and dangerous. Drown are more often evil than not.",
			"Size": "Medium",
			"Speed": 30,
			"Languages": "You can speak, read and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is ric and varied, and their songs and poems are famous amongst other race. Many bards learn their language so they can add Elvish ballads to their repertoires."
		},
		"Passive": [
			{
				"Name": "Darkvision",
				"Description": "Accustomed to twilit forest and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
			},
			{
				"Name": "Keen Senses",
				"Description": "You have proficiency in Perception skill."
			},
			{
				"Name": "Fey Ancestry",
				"Description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
			},
			{
				"Name": "Trance",
				"Description": "Elves don't need sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is 'trance.') While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
			}
		],
		"Ability": [],
		"ToolOptions": [],
		"WeaponProficiency": [],
		"Subraces": [
			{
				"Name": "High Elf",
				"AbilityModifier": [ 0, 0, 0, 1, 0, 0 ],
				"Racial": [ "Elf Weapon Training", "Cantrip", "Extra Language" ]
			},
			{
				"Name": "Wood Elf",
				"AbilityModifier": [ 0, 0, 0, 0, 1, 0 ],
				"Racial": [ "Elf Weapon Training", "Fleet of Foot", "Mask of the Wild" ]
			},
			{
				"Name": "Dark Elf (Drow)",
				"AbilityModifier": [ 0, 0, 0, 0, 0, 1 ],
				"Racial": [ "Superior Darkvision", "Sunlight Sensitivity", "Drow Weapon Training" ]
			}
		]
	},
	{
		"Name": "Halfing",
		"AbilityModifier": [ 0, 2, 0, 0, 0, 0 ],
		"Traits": {
			"Age": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.",
			"Alignment": "Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways.",
			"Size": "Small",
			"Speed": 25,
			"Languages": "You can speak, read, and write Common and Halfling. The Halfling language isn't secret, but halflings are loath to share it with others. They write very little, so they don't have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
		},
		"Passive": [
			{
				"Name": "Lucky",
				"Description": "When you roll a 1 on a D20 for an attack roll, ability check or saving throw, you can reroll the die and must use the new roll."
			},
			{
				"Name": "Brave",
				"Description": "You have advantage on saving throws against being frightened."
			},
			{
				"Name": "Halfling Nimbleness",
				"Description": "You can move through the space of any creature that is of a size larger than yours."
			}
		],
		"Ability": [],
		"ToolOptions": [],
		"WeaponProficiency": [],
		"Subraces": [
			{
				"Name": "LightFoot",
				"AbilityModifier": [ 0, 0, 0, 0, 0, 1 ],
				"Racial": [ "Naturally Stealthy" ]
			},
			{
				"Name": "Stout",
				"AbilityModifier": [ 0, 0, 1, 0, 0, 0 ],
				"Racial": [ "Stout Resilience" ]
			}
		]
	},
	{
		"Name": "Human",
		"AbilityModifier": [ 1, 1, 1, 1, 1, 1 ],
		"Traits": {
			"Age": "Humans reach adulthood in their late teens and live less than a century.",
			"Alignment": "Humans tend towards no particular alignment. The best and the worst are found among them.",
			"Size": "Medium",
			"Speed": 30,
			"Languages": "You can speak, read, and write Common and one extra language of your choice. Humans typically lean the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases and so on."
		},
		"Passive": [],
		"Ability": [],
		"ToolOptions": [],
		"WeaponProficiency": [],
		"Subraces": []
	},
	{
		"Name": "",
		"AbilityModifier": [ 0, 0, 0, 0, 0, 0 ],
		"Traits": {
			"Age": "",
			"Alignment": "",
			"Size": "",
			"Speed": 0,
			"Languages": ""
		},
		"Passive": [
			{
				"Name": "",
				"Description": ""
			}
		],
		"Ability": [],
		"ToolOptions": [],
		"WeaponProficiency": [],
		"Subraces": [
			{
				"Name": "",
				"AbilityModifier": [ 0, 0, 0, 0, 0, 0 ],
				"Racial": []
			}
		]
	}
]
